Repository: OpenRailAssociation/dac-migration-dss-popupsim
Catalog: popupsim/backend/src/core/i18n/locales/*/LC_MESSAGES/messages.po
Languages: de

source: Error: Scenario path is required but not provided
de: Fehler: Szenario-Pfad ist erforderlich, wurde aber nicht angegeben

source: Error: Scenario file does not exist: %(path)s
de: Fehler: Szenario-Datei existiert nicht: %(path)s

source: Error: Scenario path is not a file: %(path)s
de: Fehler: Szenario-Pfad ist keine Datei: %(path)s

source: Error: Scenario file is not readable: %(path)s (%(error)s)
de: Fehler: Szenario-Datei ist nicht lesbar: %(path)s (%(error)s)

source: Error: Output path is required but not provided
de: Fehler: Ausgabepfad ist erforderlich, wurde aber nicht angegeben

source: Error: Output directory does not exist: %(path)s
de: Fehler: Ausgabeverzeichnis existiert nicht: %(path)s

source: Error: Output path is not a directory: %(path)s
de: Fehler: Ausgabepfad ist kein Verzeichnis: %(path)s

source: Error: Output directory is not writable: %(path)s (%(error)s)
de: Fehler: Ausgabeverzeichnis ist nicht beschreibbar: %(path)s (%(error)s)

source: No required parameters provided. Showing help:
de: Keine erforderlichen Parameter angegeben. Hilfe wird angezeigt:

source: Error: Invalid debug level: %(level)s. Must be one of: ERROR, WARNING, INFO, DEBUG
de: Fehler: Ungültiger Debug-Level: %(level)s. Muss einer von sein: ERROR, WARNING, INFO, DEBUG

source: ✓ Using scenario file at: %(path)s
de: ✓ Verwende Szenario-Datei unter: %(path)s

source: ✓ Output will be saved to: %(path)s
de: ✓ Ausgabe wird gespeichert unter: %(path)s

source: ✓ Verbose mode enabled.
de: ✓ Ausführlicher Modus aktiviert.

source: ✓ Debug level set to: %(level)s
de: ✓ Debug-Level gesetzt auf: %(level)s

source: Scenario loaded and validated successfully.
de: Szenario erfolgreich geladen und validiert.

source: Scenario ID: %(id)s
de: Szenario-ID: %(id)s

source: Start Date: %(date)s
de: Startdatum: %(date)s

source: End Date: %(date)s
de: Enddatum: %(date)s

source: Number of Trains: %(count)d
de: Anzahl der Züge: %(count)d

source: Number of Workshop Tracks: %(count)d
de: Anzahl der Werkstattgleise: %(count)d

source: Number of Routes: %(count)d
de: Anzahl der Routen: %(count)d

source: Validation Summary:
de: Validierungszusammenfassung:

source: Configuration error: %(error)s
de: Konfigurationsfehler: %(error)s

source: Unexpected error: %(error)s
de: Unerwarteter Fehler: %(error)s

source: 🚀 Starting popupsim processing...
de: 🚀 Starte popupsim-Verarbeitung...

source: Application would start processing here...
de: Anwendung würde hier mit der Verarbeitung beginnen...
